# HR Schema

In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
cnn=sql.connect('HR.db')

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///Hr.db

In [38]:
%%sql
drop table if exists employees;
drop table if exists job_history;
drop table if exists jobs;
drop table if exists departments;
drop table if exists locations;
CREATE TABLE EMPLOYEES (
                            EMP_ID CHAR(9) NOT NULL, 
                            F_NAME VARCHAR(15) NOT NULL,
                            L_NAME VARCHAR(15) NOT NULL,
                            SSN CHAR(9),
                            B_DATE DATE,
                            SEX CHAR,
                            ADDRESS VARCHAR(30),
                            JOB_ID CHAR(9),
                            SALARY DECIMAL(10,2),
                            MANAGER_ID CHAR(9),
                            DEP_ID CHAR(9) NOT NULL,
                            PRIMARY KEY (EMP_ID));
                            
  CREATE TABLE JOB_HISTORY (
                            EMPL_ID CHAR(9) NOT NULL, 
                            START_DATE DATE,
                            JOBS_ID CHAR(9) NOT NULL,
                            DEPT_ID CHAR(9),
                            PRIMARY KEY (EMPL_ID,JOBS_ID));
 
 CREATE TABLE JOBS (
                            JOB_IDENT CHAR(9) NOT NULL, 
                            JOB_TITLE VARCHAR(30),
                            MIN_SALARY DECIMAL(10,2),
                            MAX_SALARY DECIMAL(10,2),
                            PRIMARY KEY (JOB_IDENT));

CREATE TABLE DEPARTMENTS (
                            DEPT_ID_DEP CHAR(9) NOT NULL, 
                            DEP_NAME VARCHAR(15) ,
                            MANAGER_ID CHAR(9),
                            LOC_ID CHAR(9),
                            PRIMARY KEY (DEPT_ID_DEP));

CREATE TABLE LOCATIONS (
                            LOCT_ID CHAR(9) NOT NULL,
                            DEP_ID_LOC CHAR(9) NOT NULL,
                            PRIMARY KEY (LOCT_ID,DEP_ID_LOC));

 * sqlite:///Hr.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [39]:
department=pd.read_csv('datasets/Departments.csv', index_col='DEPT_ID_DEP')
department.to_sql(name='DEPARTMENTS',con=cnn, schema='HR',if_exists='append')
department

                    DEP_NAME  MANAGER_ID LOC_ID
DEPT_ID_DEP
2            Architect Group       30001  L0001
5             Software Group       30002  L0002
7                Design Team       30003  L0003

In [40]:
jobs=pd.read_csv('datasets/Jobs.csv',index_col='JOB_IDENT')
jobs.to_sql('JOBS',cnn,if_exists='append')
jobs_history=pd.read_csv('datasets/JobsHistory.csv',index_col='EMPL_ID')
jobs_history.to_sql('JOB_HISTORY',cnn, if_exists='append')
locations=pd.read_csv('datasets/Locations.csv',index_col='LOCT_ID')
locations.to_sql('LOCATIONS',cnn,if_exists='append')
employee=pd.read_csv('datasets/Employees.csv',index_col='EMP_ID')
employee.to_sql('EMPLOYEES',cnn,if_exists='append')

10

In [42]:
%%sql
select * from employees

 * sqlite:///Hr.db
Done.

[('E1001', 'John', 'Thomas', '123456', '01-09-1976', 'M', '5631 Rice, OakPark,IL', '100', 100000, '30001', '2'),
 ('E1002', 'Alice', 'James', '123457', '31-07-1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5'),
 ('E1003', 'Steve', 'Wells', '123458', '08-10-1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5'),
 ('E1004', 'Santosh', 'Kumar', '123459', '20-07-1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30002', '5'),
 ('E1005', 'Ahmed', 'Hussain', '123410', '01-04-1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2'),
 ('E1006', 'Nancy', 'Allen', '123411', '02-06-1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2'),
 ('E1007', 'Mary', 'Thomas', '123412', '05-05-1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7'),
 ('E1008', 'Bharath', 'Gupta', '123413', '05-06-1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7'),
 ('E1009', 'Andrea', 'Jones', '123414', '07-09-1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7'),
 ('E1010', 'Ann', 'Jacob', '123415', '30-03-1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30002', '5')]

In [43]:
%%sql
select f_name, l_name from employees where address like '%Elgin,IL'

 * sqlite:///Hr.db
Done.

[('Alice', 'James'), ('Nancy', 'Allen'), ('Ann', 'Jacob')]

In [47]:
%%sql
select f_name, l_name from employees where B_DATE like '%197%'

 * sqlite:///Hr.db
Done.

[('John', 'Thomas'),
 ('Alice', 'James'),
 ('Nancy', 'Allen'),
 ('Mary', 'Thomas')]

In [50]:
%%sql
select * from employees where salary between 60000 and 70000 and dep_id=5

 * sqlite:///Hr.db
Done.

[('E1004', 'Santosh', 'Kumar', '123459', '20-07-1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30002', '5'),
 ('E1010', 'Ann', 'Jacob', '123415', '30-03-1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30002', '5')]

# Sorting

In [51]:
%%sql
SELECT F_NAME, L_NAME, DEP_ID 
FROM EMPLOYEES
ORDER BY DEP_ID;

 * sqlite:///Hr.db
Done.

[('John', 'Thomas', '2'),
 ('Ahmed', 'Hussain', '2'),
 ('Nancy', 'Allen', '2'),
 ('Alice', 'James', '5'),
 ('Steve', 'Wells', '5'),
 ('Santosh', 'Kumar', '5'),
 ('Ann', 'Jacob', '5'),
 ('Mary', 'Thomas', '7'),
 ('Bharath', 'Gupta', '7'),
 ('Andrea', 'Jones', '7')]

In [52]:
%%sql
SELECT F_NAME, L_NAME, DEP_ID 
FROM EMPLOYEES
ORDER BY DEP_ID DESC, L_NAME DESC;

 * sqlite:///Hr.db
Done.

[('Mary', 'Thomas', '7'),
 ('Andrea', 'Jones', '7'),
 ('Bharath', 'Gupta', '7'),
 ('Steve', 'Wells', '5'),
 ('Santosh', 'Kumar', '5'),
 ('Alice', 'James', '5'),
 ('Ann', 'Jacob', '5'),
 ('John', 'Thomas', '2'),
 ('Ahmed', 'Hussain', '2'),
 ('Nancy', 'Allen', '2')]

# Grouping

In [54]:
%%sql
SELECT DEP_ID, COUNT(*)
FROM EMPLOYEES
GROUP BY DEP_ID;

 * sqlite:///Hr.db
Done.

[('2', 3), ('5', 4), ('7', 3)]

In [56]:
%%sql
SELECT DEP_ID, COUNT(*) as 'NUM_EMPLOYEES', AVG(SALARY)
FROM EMPLOYEES
GROUP BY DEP_ID;

 * sqlite:///Hr.db
Done.

[('2', 3, 86666.66666666667), ('5', 4, 65000.0), ('7', 3, 66666.66666666667)]

In [57]:
%%sql
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
ORDER BY AVG_SALARY;

 * sqlite:///Hr.db
Done.

[('5', 4, 65000.0), ('7', 3, 66666.66666666667), ('2', 3, 86666.66666666667)]

In [58]:
%%sql
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
HAVING count(*) < 4
ORDER BY AVG_SALARY;

 * sqlite:///Hr.db
Done.

[('7', 3, 66666.66666666667), ('2', 3, 86666.66666666667)]

In [62]:
%%sql
select DEP_ID, avg(salary) from employees group by dep_id having avg(salary)>=60000

 * sqlite:///Hr.db
Done.

[('2', 86666.66666666667), ('5', 65000.0), ('7', 66666.66666666667)]